#-*- coding:utf-8 -*-
# 파이썬 2 버전 - 기본 인코딩 방식이 ASCII 코드 기반이라 한글 인코딩 불가능
# 파이썬 3 버전 이상은 기본 인코딩이 UTF-8
# 혹시나 파이썬을 다른 개발 환경이랑 연결하거나하면 명시를 해주는게 좋음

print("asdf")

"""
Python - BigData, AI 등의 분야에 많이 활용함

분석용 데이터 구축
직접 긁어 모으기 : 출/퇴근 시간에 노약자석 누가 앉는지 체크
누군가가 모아놓은 데이터 구매 - 비쌈
웹의 데이터를 긁어오기(XML, JSON, HTML) - 크롤링

긁어온 데이터를 분석할 때
분석을 사람이 하면 -> BigData 분석 프로젝트
AI가 하면 -> AI 프로젝트
결과를 한 눈에 알아보기 쉽게 시각화(표, 그래프) 하는 것 까지 진행 할 예정

Python도 프로그래밍 언어임
#####

Java vs Python

Java : 규칙의 언어
자바를 사용하기 위해 필수적으로 JDK가 필요함
프롬프트 환경에서 실행은 가능하지만, 편한 사용을 위해 그냥 Eclipse IDE를 사용
Project - 중요한 구분 단위였음
컴파일러 방식으로 구동
OOP 형식의 코드를 재사용하기 위해 하나의 파일에 하나의 클래스를 선언하는식으로 사용했음

########################
Python : 좀 더 자유로운 언어
파이썬을 사용하기 위해 필수적인 것들 : 파이썬 설치(3.8.10), IDE 환경(Eclipse - pyDev 확장), 기본 IDE IDLE은 불편해서 안씀
Add Python 3.8 Path 체크 - 환경 변수 설정
Project - Python 환경에서는 단순한 폴더임
인터프리터 방식으로 구동
OOP 형식 코드 재사용에는 별 관심이 없는 언어임 - 하나의 파일에 클래스 여러 개를 선언 할 수 있음

######################

BigData 다루는 내용을 먼저 할 예정

1) Python : 분석용 데이터 구축
2) Hadoop : 분석 서비스 << 리눅스 환경에서 분석
3) Python, R : 분석 데이터 시각화

분석 데이터 구축
1) Python으로 xml/json 파싱 -> DB에 넣을 예정
2) DB에 있는 데이터를 분석용 파일로 재구축(.csv, .txt)


"""













