package com.kim.may_29_1.main;

//	어떤 언어를 공부하려 하든 - 조건문, 반목문, 자료구조가 기본

//자바에서 배열은 collection
// 외부 라이브러리 끌어오기 - build path에서 라이브러리 추가
//parsing - http 통신으로 데이터 긁어오기

//	배열 [] - 변수 하나에 데이터를 여러개...
//	배열의 치명적 단점 - 배열 선언시 크기가 고정됨, 크기 예측을 못하면 배열을 사용하지 못함
//	+초기화 이후엔 크기 변경이 불가능

//	Collection : Java에서 자료구조(data structure)를 표현한 클래스들을 지칭하는 용어

//	List 계열 
//		가변 사이즈
//		요소들의 index값이 존재함(순서 존재), 중복된 값을 가질 수 있음

//	Set 계열(거의 안씀)
//		가변 사이즈
//		중복데이터를 자동으로 삭제
//		순서가 랜덤

//	Map 계열
//		가변사이즈
//		Key, value 한 쌍으로 구성됨
//			Key값을 호출하면 Key에 해당하는 Value를 사용
//		순서 개념이 없음

//컬렉션 쓸 거니까 이중배열은 쓰지 말자...
public class CMain1 {
	
	
	
}
